{"pages":[{"url":"search.html","text":"\n\n\nMordor-lab\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n          Las escrituras del Nigromancer\n        \n\n\nBuscar\n\n\n\n\n\n\n \n\n\n\n\n\n\nArchivos\nRSS\ntwitter\n\n\n2008-2014 © Las escrituras del Nigromancer | Powered by Pelican| CC BY\n\n\n\n\n\n\n\n\n\n$(document).ready(function() {\n     $('#tipue_search_input').tipuesearch({\n          'show': 10,\n          'mode': 'json',\n          'contentLocation': 'tipuesearch_content.json'\n     });\n});\n\n\n","tags":"","title":"Mordor-lab"},{"url":"blog/dmenu","text":"Hay mucha gente que prefiere tener lanzadores a un click de distancia, pero para muchos (como yo) alejarse del teclado al mouse implica un esfuerzo extra. Así que a la hora de lanzar una aplicación lo que prefiero es usar dmenu . dmenu es rapido, dinamico y ligero para entornos X, originalmente diseñado para dwm (un manejador de ventanas que espero pronto escribir sobre el, es especial porque he probado dwmX y me entusiasma mucho). Instalación En la familia de debian dmenu esta incluido en los paquetes suckless-tools # apt-get install suckless-tools Configuración Una vez instalado es recomendable configurar teclas de acceso rápido a dmenu. Esto puede hacerlo vía las configuraciones de su entorno gráfico (Gnome, KDE, XFCE, Openbox, etc). En mi caso como uso Openbox la configuración la hago en el archivo ~.config/openbox/rc.xml Mas precisamente de esta manera: <keybind key= \"A-F3\" > <action name= \"Execute\" > <startupnotify> <enabled> false </enabled> <name> dmenu-bind </name> </startupnotify> <command> ~/.config/dmenu/dmenu-bind.sh </command> </action> </keybind> Como ven, el comando que ejecuta apunta a ~/.config/dmenu/dmenu-bind.sh , este es un script donde he configurado las opciones de como se lanzara mi dmenu. Entre algunas de las opciones que pueden configurar son: Color de letra, color de fondo, tipo de letra, color de selección, posición, etc. Ahora les muestro mi configuración: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 #!/bin/bash # # written for nigromancer @nigrobyte based on Bunsenlabs # # -nb normal background colour # -nf normal foreground colour # -sb selected background colour # -sf selected foreground colour # # -b place menu at bottom (otherwise top) # # See 'man dmenu' for more information. USAGE = \"\\n To start dmenu at the top or bottom of the screen,\\n\\ add or remove -b in the dmenu_run command in dmenu-bind.sh.\\n\\ -b locate at bottom\\n\\n\\ To change colours, edit the options:\\n\\n\\ -nb normal background colour\\n\\ -nf normal foreground colour\\n\\ -sb selected background colour\\n\\ -sf selected foreground colour\\n\\n\\ Get all configuration options with 'man dmenu'.\\n\" if [[ $# = 1 ]] ; then case $1 in -h | --help ) echo -e \" $USAGE \" exit 0 ;; * ) echo -e \"\\n Invalid command argument\\n\" exit 1 ;; esac fi dmenu_run -b -i -nb '#151617' -nf '#FF9C00' -sb '#FF9C00' -sf '#151617' -fn 'monofur for Powerline Regular-10' Se ve de la siguiente manera: Por si no lo notan, es el lanzador que se ve en la parte de abajo del escritorio. XD Saludos, y espero vayan dejando de lado el mouse y ganando velocidad al lanzar sus aplicaciones.","tags":"About","title":"dmenu"},{"url":"blog/nsa-en-github","text":"La Agencia Nacional de Seguridad (NSA por sus siglas en inglés), es una de las agencias secretas de inteligencia de los EE.UU.'. Donde emplean programadores y matemáticos de gran talento con el fin de romper códigos, cifrados, reunir información sobre adversarios, y defender el país contra las amenazas digitales. Como era de esperar, la NSA siempre ha preferido trabajar en la oscuridad. Pero desde que las filtraciones de Snowden en 2013, la organización ha aumentado gradualmente su presencia pública. Hace algunos años, se abrió una cuenta de Twitter (de hecho, fue el primer perfil de Edward Snowden siguió cuando se unió en 2015 ). Y ahora, se abrió una cuenta de Github, y ha compartido varios repositorios de código interesantes en el marco del Programa de Transferencia de Tecnología de la NSA (TTP) . Hasta el momento, se enumeran 32 proyectos diferentes, aunque algunos de ellos están 'en proceso'. Muchos de ellos en realidad no son nuevos, es decir, ya han estado disponibles desde hace algún tiempo. por ejemplo SELinux (Security-Enhanced Linux), ha sido parte del núcleo de Linux desde hace años. No me sorprende que la NSA ha tomado esta medida. Para empezar, hay una larga y orgullosa tradición de tecnologías que hacen su camino desde los entornos de defensa e inteligencia al público en general. El Internet es un brillante ejemplo de ello. Y comprometerse con expertos en tecnología a través de Github es una gran manera de sanear su imagen, y potencialmente reclutar talento. Si deseas entrar al perfil de Github de la NSA presiona aquí . fuente: http://telegra.ph/Si-Ahora-la-NSA-tiene-una-cuenta-en-Github-06-19","tags":"About","title":"NSA en Github"},{"url":"blog/nigromancer","text":"Bienvenidos sean visitantes del ciberespacio a las mazmorras de Mordor, un lugar donde escribiré lo que tenga ganas de escribir mientras voy forjando al Único. Un script para gobernarlos a todos. Un script para encontrarlos, un script para atraerlos a todos y atarlos en las tinieblas.","tags":"About","title":"Nigromancer"}]}